docs/implementation/2026-09-06-human-interruption/evidence/publication-recovery/durable-ingest-mutation.patch
--- packs/autonomy/repo-template/scripts/quality-orchestrator/product.mjs
+++ packs/autonomy/repo-template/scripts/quality-orchestrator/product.mjs
@@ -91 +91 @@
-    if(v2&&['REVIEW','FOCAL'].includes(r.kind)){const n=s.normalized[p.key];must(n&&n.digest===r.normalizedOutputDigest,'review has no durable normalization');const payload=journal.getObject(n.digest);must(sha256(canonical(payload))===n.digest&&r.ingestedBytesDigest===n.digest&&canonical(payload.review)===canonical(r.review),'ingest bytes differ from durable review');s.ingestions.push({key:p.key,normalizedOutputDigest:n.digest,ingestedBytesDigest:r.ingestedBytesDigest,sessionId:r.sessionId});if(r.kind==='REVIEW'){must(s.counters.fullReview===0,'full judgment already consumed');s.counters.fullReview++;}else{must(s.counters.fixAttempts<2,'fix judgment exhausted');s.counters.fixAttempts++;}}
+    if(v2&&['REVIEW','FOCAL'].includes(r.kind)){const n=s.normalized[p.key];must(n&&n.digest===r.normalizedOutputDigest,'review has no durable normalization');const payload=normalized(s,journal.readAcknowledgement(ackDigest(s,p.key)));must(sha256(canonical(payload))===n.digest&&r.ingestedBytesDigest===n.digest&&canonical(payload.review)===canonical(r.review),'ingest bytes differ from durable review');s.ingestions.push({key:p.key,normalizedOutputDigest:n.digest,ingestedBytesDigest:r.ingestedBytesDigest,sessionId:r.sessionId});if(r.kind==='REVIEW'){must(s.counters.fullReview===0,'full judgment already consumed');s.counters.fullReview++;}else{must(s.counters.fixAttempts<2,'fix judgment exhausted');s.counters.fixAttempts++;}}
@@ -314 +314 @@
-   const persisted=journal.getObject(s.normalized[key].digest),ingestedBytesDigest=sha256(canonical(persisted));must(ingestedBytesDigest===digest,'normalized output differs at ingest');
+   const persisted=payload,ingestedBytesDigest=sha256(canonical(persisted));must(ingestedBytesDigest===digest,'normalized output differs at ingest');
